huanglilong/esp32s31_korvo1/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set (ESP32-S31 RISC-V may not support PSRAM XIP)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_INCLUDE_xTaskGetIdleTaskHandle=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_320=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=320

# SNTP — sync wall-clock time after WiFi connects (needed for ULog date-based naming)
CONFIG_LWIP_SNTP_MAX_SERVERS=1
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
CONFIG_LWIP_SNTP_STARTUP_DELAY=y
CONFIG_LWIP_SNTP_MAXIMUM_STARTUP_DELAY=5000
CONFIG_SNTP_SERVER_0="pool.ntp.org"
CONFIG_SNTP_DEFAULT_TIMEZONE="CST-8"

# FATFS
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096

# Increase VFS table size — SD card (fatfs) + more entries
CONFIG_VFS_MAX_COUNT=16

# ESP32-S31 BSP configuration (espressif/esp32_s31_korvo_1 v1.0.0~1)
# Note: BSP uses CONFIG_BSP_ prefix for its Kconfig options
# Audio: MCLK is NOT connected on ESP32-S31 → use 16kHz sample rate
CONFIG_BSP_I2S_SAMPLE_RATE=22050
CONFIG_BSP_LCD_H_RES=800
CONFIG_BSP_LCD_V_RES=480
# Display LVGL config
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=80
CONFIG_BSP_LCD_RGB_BUFFER_NUMS=2
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
# LED RGB backend (uses RMT for WS2812)
CONFIG_BSP_LED_RGB_BACKEND_RMT=y
# SPIFFS for internal storage
CONFIG_BSP_SPIFFS_MOUNT_POINT="/spiffs"
CONFIG_BSP_SPIFFS_PARTITION_LABEL="storage"
CONFIG_BSP_SPIFFS_MAX_FILES=5

# Audio I2S and I2C pins (TBD - will be updated when pin mapping is confirmed)
CONFIG_EXAMPLE_VOICE_VOLUME=80
CONFIG_EXAMPLE_I2C_SCL_IO=1
CONFIG_EXAMPLE_I2C_SDA_IO=0
CONFIG_EXAMPLE_I2S_MCLK_IO=42
CONFIG_EXAMPLE_I2S_BCLK_IO=3
CONFIG_EXAMPLE_I2S_WS_IO=4
CONFIG_EXAMPLE_I2S_DOUT_IO=5
CONFIG_EXAMPLE_I2S_DIN_IO=6

# WiFi
CONFIG_ESP_WIFI_STA_RECONNECT=y
CONFIG_ESP_WIFI_CONNECT_RETRY_CNT=5

# LWIP TCP
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_MAX_SOCKETS=28
CONFIG_LWIP_MAX_ACTIVE_TCP=40
CONFIG_LWIP_MAX_LISTENING_TCP=24

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=8

# ULog
CONFIG_ULOG_ENABLE=y

# Audio Codec (ES8389 via esp_codec_dev)
CONFIG_CODEC_ES8389_SUPPORT=y

# Camera (DVP OV3660) - sensor driver + auto-detect
CONFIG_CAMERA_OV3660=y
CONFIG_CAMERA_OV3660_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV3660_DVP_RGB565_BE_640X480_10FPS=y
CONFIG_CAMERA_OV3660_DVP_DEFAULT_FMT_RGB565_BE_640X480_10FPS=y

# PPA hardware acceleration is used directly by CameraApp (not via LVGL port)
# LVGL_PORT_ENABLE_PPA is P4-only (lcd_ppa.c relies on CONFIG_CACHE_L2_CACHE_LINE_SIZE)
# CONFIG_LVGL_PORT_ENABLE_PPA is not set

# LVGL SW rendering with asm optimizations
CONFIG_LV_USE_DRAW_SW_ASM=y

# Allocate WiFi/LWIP from PSRAM to save SRAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096